LogFiles/JsonPerfectClientWrk2V2.txt
Running 1m test @ http://169.254.90.222:8081/jsonShortPerfect
  2 threads and 10 connections
  Thread calibration: mean lat.: 1.592ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.590ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.59ms  698.17us   5.80ms   64.38%
    Req/Sec     3.15k   285.93     4.22k    68.87%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.53ms
 75.000%    2.07ms
 90.000%    2.58ms
 99.000%    3.29ms
 99.900%    3.74ms
 99.990%    4.40ms
 99.999%    5.01ms
100.000%    5.80ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.201     0.000000            1         1.00
       0.717     0.100000        29902         1.11
       0.927     0.200000        59834         1.25
       1.132     0.300000        89635         1.43
       1.332     0.400000       119552         1.67
       1.527     0.500000       149494         2.00
       1.625     0.550000       164406         2.22
       1.726     0.600000       179341         2.50
       1.832     0.650000       194206         2.86
       1.946     0.700000       209222         3.33
       2.069     0.750000       224131         4.00
       2.135     0.775000       231636         4.44
       2.209     0.800000       239143         5.00
       2.287     0.825000       246583         5.71
       2.373     0.850000       253959         6.67
       2.469     0.875000       261443         8.00
       2.523     0.887500       265220         8.89
       2.579     0.900000       268999        10.00
       2.637     0.912500       272713        11.43
       2.699     0.925000       276362        13.33
       2.771     0.937500       280121        16.00
       2.809     0.943750       281992        17.78
       2.849     0.950000       283857        20.00
       2.891     0.956250       285694        22.86
       2.939     0.962500       287584        26.67
       2.993     0.968750       289435        32.00
       3.025     0.971875       290401        35.56
       3.057     0.975000       291312        40.00
       3.095     0.978125       292261        45.71
       3.135     0.981250       293184        53.33
       3.181     0.984375       294122        64.00
       3.207     0.985938       294559        71.11
       3.237     0.987500       295041        80.00
       3.267     0.989062       295484        91.43
       3.299     0.990625       295958       106.67
       3.341     0.992188       296423       128.00
       3.361     0.992969       296658       142.22
       3.387     0.993750       296896       160.00
       3.415     0.994531       297129       182.86
       3.445     0.995313       297355       213.33
       3.481     0.996094       297589       256.00
       3.501     0.996484       297711       284.44
       3.523     0.996875       297816       320.00
       3.549     0.997266       297935       365.71
       3.577     0.997656       298055       426.67
       3.607     0.998047       298168       512.00
       3.627     0.998242       298224       568.89
       3.651     0.998437       298285       640.00
       3.675     0.998633       298345       731.43
       3.705     0.998828       298404       853.33
       3.743     0.999023       298459      1024.00
       3.757     0.999121       298487      1137.78
       3.781     0.999219       298517      1280.00
       3.807     0.999316       298546      1462.86
       3.843     0.999414       298574      1706.67
       3.885     0.999512       298604      2048.00
       3.917     0.999561       298618      2275.56
       3.943     0.999609       298634      2560.00
       3.999     0.999658       298648      2925.71
       4.029     0.999707       298662      3413.33
       4.081     0.999756       298677      4096.00
       4.111     0.999780       298684      4551.11
       4.155     0.999805       298692      5120.00
       4.199     0.999829       298698      5851.43
       4.283     0.999854       298706      6826.67
       4.335     0.999878       298713      8192.00
       4.375     0.999890       298717      9102.22
       4.411     0.999902       298720     10240.00
       4.431     0.999915       298724     11702.86
       4.515     0.999927       298729     13653.33
       4.527     0.999939       298731     16384.00
       4.571     0.999945       298733     18204.44
       4.619     0.999951       298735     20480.00
       4.683     0.999957       298737     23405.71
       4.703     0.999963       298739     27306.67
       4.803     0.999969       298740     32768.00
       4.819     0.999973       298741     36408.89
       4.827     0.999976       298742     40960.00
       4.903     0.999979       298743     46811.43
       4.979     0.999982       298744     54613.33
       4.987     0.999985       298745     65536.00
       4.987     0.999986       298745     72817.78
       5.007     0.999988       298746     81920.00
       5.007     0.999989       298746     93622.86
       5.143     0.999991       298747    109226.67
       5.143     0.999992       298747    131072.00
       5.143     0.999993       298747    145635.56
       5.467     0.999994       298748    163840.00
       5.467     0.999995       298748    187245.71
       5.467     0.999995       298748    218453.33
       5.467     0.999996       298748    262144.00
       5.467     0.999997       298748    291271.11
       5.803     0.999997       298749    327680.00
       5.803     1.000000       298749          inf
#[Mean    =        1.591, StdDeviation   =        0.698]
#[Max     =        5.800, Total count    =       298749]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  358612 requests in 1.00m, 51.98MB read
Requests/sec:   5976.82
Transfer/sec:      0.87MB