LogFiles/JsonPerfectClientWrkV1bc.txt
Running 1m test @ http://169.254.90.222:8081/jsonPerfect
  2 threads and 10 connections
  Thread calibration: mean lat.: 6.438ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 6.413ms, rate sampling interval: 18ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.06ms    1.91ms  15.90ms   75.03%
    Req/Sec    54.34     79.27   294.00     80.13%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.45ms
 75.000%    6.89ms
 90.000%    8.64ms
 99.000%   12.43ms
 99.900%   15.19ms
 99.990%   15.90ms
 99.999%   15.90ms
100.000%   15.90ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.253     0.000000            1         1.00
       4.155     0.100000          550         1.11
       4.559     0.200000         1100         1.25
       4.875     0.300000         1649         1.43
       5.151     0.400000         2199         1.67
       5.455     0.500000         2751         2.00
       5.723     0.550000         3020         2.22
       6.039     0.600000         3299         2.50
       6.351     0.650000         3572         2.86
       6.607     0.700000         3849         3.33
       6.895     0.750000         4119         4.00
       7.079     0.775000         4255         4.44
       7.335     0.800000         4395         5.00
       7.615     0.825000         4530         5.71
       8.007     0.850000         4667         6.67
       8.327     0.875000         4805         8.00
       8.471     0.887500         4878         8.89
       8.639     0.900000         4943        10.00
       8.823     0.912500         5011        11.43
       9.087     0.925000         5081        13.33
       9.383     0.937500         5148        16.00
       9.639     0.943750         5183        17.78
       9.823     0.950000         5216        20.00
      10.175     0.956250         5250        22.86
      10.583     0.962500         5285        26.67
      10.879     0.968750         5319        32.00
      11.023     0.971875         5336        35.56
      11.247     0.975000         5353        40.00
      11.519     0.978125         5371        45.71
      11.839     0.981250         5388        53.33
      12.031     0.984375         5405        64.00
      12.143     0.985938         5414        71.11
      12.215     0.987500         5422        80.00
      12.375     0.989062         5430        91.43
      12.495     0.990625         5439       106.67
      12.647     0.992188         5448       128.00
      12.759     0.992969         5452       142.22
      12.823     0.993750         5456       160.00
      12.887     0.994531         5460       182.86
      13.223     0.995313         5465       213.33
      13.727     0.996094         5469       256.00
      13.959     0.996484         5471       284.44
      14.095     0.996875         5473       320.00
      14.207     0.997266         5475       365.71
      14.823     0.997656         5478       426.67
      14.967     0.998047         5480       512.00
      14.983     0.998242         5481       568.89
      15.055     0.998437         5482       640.00
      15.087     0.998633         5483       731.43
      15.175     0.998828         5484       853.33
      15.191     0.999023         5485      1024.00
      15.343     0.999121         5486      1137.78
      15.343     0.999219         5486      1280.00
      15.391     0.999316         5487      1462.86
      15.391     0.999414         5487      1706.67
      15.543     0.999512         5488      2048.00
      15.543     0.999561         5488      2275.56
      15.543     0.999609         5488      2560.00
      15.903     0.999658         5490      2925.71
      15.903     1.000000         5490          inf
#[Mean    =        6.058, StdDeviation   =        1.914]
#[Max     =       15.896, Total count    =         5490]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6502 requests in 1.08m, 43.44MB read
Requests/sec:    100.01
Transfer/sec:    684.17KB